experiment-data/MicroK8s/dp_redis_density/dp_redis_density/memtier-0.out
4         Threads
50        Connections per thread
600       Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets         1347.37          ---          ---        13.44098        10.36700        76.28700       151.55100       103.80 
Gets        13472.07         2.33     13469.74        13.47558        10.36700        77.31100       153.59900       524.85 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals      14819.45         2.33     13469.74        13.47244        10.36700        77.31100       153.59900       628.65 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.263        0.000
SET       2.943        5.000
SET       4.575       10.000
SET       5.727       15.000
SET       6.687       20.000
SET       7.327       25.000
SET       7.967       30.000
SET       8.639       35.000
SET       9.279       40.000
SET       9.791       45.000
SET      10.367       50.000
SET      10.687       52.500
SET      11.007       55.000
SET      11.391       57.500
SET      11.839       60.000
SET      12.159       62.500
SET      12.607       65.000
SET      13.119       67.500
SET      13.695       70.000
SET      14.271       72.500
SET      14.911       75.000
SET      15.231       76.250
SET      15.679       77.500
SET      16.127       78.750
SET      16.639       80.000
SET      17.151       81.250
SET      17.663       82.500
SET      18.431       83.750
SET      19.071       85.000
SET      19.839       86.250
SET      20.735       87.500
SET      21.247       88.125
SET      21.759       88.750
SET      22.399       89.375
SET      23.039       90.000
SET      23.679       90.625
SET      24.447       91.250
SET      25.215       91.875
SET      26.239       92.500
SET      27.263       93.125
SET      28.543       93.750
SET      29.311       94.062
SET      30.079       94.375
SET      31.103       94.688
SET      32.127       95.000
SET      33.279       95.312
SET      34.559       95.625
SET      35.839       95.938
SET      37.375       96.250
SET      39.167       96.562
SET      41.215       96.875
SET      42.239       97.031
SET      43.519       97.188
SET      44.799       97.344
SET      46.335       97.500
SET      48.127       97.656
SET      49.663       97.812
SET      51.967       97.969
SET      54.271       98.125
SET      57.087       98.281
SET      60.159       98.438
SET      61.951       98.516
SET      63.743       98.594
SET      66.047       98.672
SET      68.095       98.750
SET      70.655       98.828
SET      73.215       98.906
SET      75.775       98.984
SET      78.847       99.062
SET      81.919       99.141
SET      84.991       99.219
SET      86.527       99.258
SET      88.575       99.297
SET      90.623       99.336
SET      92.159       99.375
SET      94.207       99.414
SET      96.255       99.453
SET      98.303       99.492
SET     100.863       99.531
SET     103.423       99.570
SET     105.983       99.609
SET     107.007       99.629
SET     108.543       99.648
SET     110.591       99.668
SET     112.639       99.688
SET     114.687       99.707
SET     116.735       99.727
SET     118.271       99.746
SET     120.831       99.766
SET     123.391       99.785
SET     125.951       99.805
SET     127.999       99.814
SET     129.535       99.824
SET     132.095       99.834
SET     134.143       99.844
SET     136.191       99.854
SET     138.239       99.863
SET     141.311       99.873
SET     144.383       99.883
SET     148.479       99.893
SET     153.599       99.902
SET     155.647       99.907
SET     156.671       99.912
SET     159.743       99.917
SET     161.791       99.922
SET     163.839       99.927
SET     166.911       99.932
SET     169.983       99.937
SET     172.031       99.941
SET     176.127       99.946
SET     179.199       99.951
SET     181.247       99.954
SET     183.295       99.956
SET     186.367       99.958
SET     189.439       99.961
SET     191.487       99.963
SET     195.583       99.966
SET     199.679       99.968
SET     201.727       99.971
SET     204.799       99.973
SET     209.919       99.976
SET     212.991       99.977
SET     215.039       99.978
SET     217.087       99.979
SET     219.135       99.980
SET     221.183       99.982
SET     224.255       99.983
SET     226.303       99.984
SET     228.351       99.985
SET     229.375       99.987
SET     235.519       99.988
SET     238.591       99.988
SET     240.639       99.989
SET     242.687       99.990
SET     243.711       99.990
SET     245.759       99.991
SET     248.831       99.991
SET     251.903       99.992
SET     254.975       99.993
SET     257.023       99.993
SET     260.095       99.994
SET     264.191       99.994
SET     266.239       99.995
SET     268.287       99.995
SET     270.335       99.995
SET     272.383       99.995
SET     274.431       99.996
SET     274.431       99.996
SET     280.575       99.996
SET     282.623       99.997
SET     282.623       99.997
SET     284.671       99.997
SET     284.671       99.997
SET     290.815       99.997
SET     292.863       99.998
SET     296.959       99.998
SET     299.007       99.998
SET     303.103       99.998
SET     307.199       99.998
SET     309.247       99.998
SET     309.247       99.998
SET     309.247       99.999
SET     309.247       99.999
SET     311.295       99.999
SET     313.343       99.999
SET     313.343       99.999
SET     317.439       99.999
SET     317.439       99.999
SET     317.439       99.999
SET     327.679       99.999
SET     327.679       99.999
SET     333.823       99.999
SET     333.823       99.999
SET     333.823       99.999
[...]
SET     333.823      100.000
SET     344.063      100.000
SET     344.063      100.000
SET     344.063      100.000
SET     360.447      100.000
SET     360.447      100.000
SET     360.447      100.000
[...]
SET     393.215      100.000
SET     393.215      100.000
SET     393.215      100.000
[...]
SET     495.615      100.000
SET     495.615      100.000
---
GET       0.247        0.000
GET       2.927        5.000
GET       4.575       10.000
GET       5.727       15.000
GET       6.687       20.000
GET       7.327       25.000
GET       7.967       30.000
GET       8.639       35.000
GET       9.279       40.000
GET       9.791       45.000
GET      10.367       50.000
GET      10.687       52.500
GET      11.071       55.000
GET      11.391       57.500
GET      11.839       60.000
GET      12.223       62.500
GET      12.671       65.000
GET      13.183       67.500
GET      13.695       70.000
GET      14.335       72.500
GET      14.911       75.000
GET      15.295       76.250
GET      15.679       77.500
GET      16.127       78.750
GET      16.639       80.000
GET      17.151       81.250
GET      17.791       82.500
GET      18.431       83.750
GET      19.071       85.000
GET      19.839       86.250
GET      20.735       87.500
GET      21.247       88.125
GET      21.759       88.750
GET      22.399       89.375
GET      23.039       90.000
GET      23.679       90.625
GET      24.447       91.250
GET      25.215       91.875
GET      26.239       92.500
GET      27.263       93.125
GET      28.543       93.750
GET      29.311       94.062
GET      30.207       94.375
GET      31.103       94.688
GET      32.127       95.000
GET      33.279       95.312
GET      34.559       95.625
GET      36.095       95.938
GET      37.375       96.250
GET      39.423       96.562
GET      41.471       96.875
GET      42.495       97.031
GET      43.775       97.188
GET      45.311       97.344
GET      46.591       97.500
GET      48.383       97.656
GET      50.175       97.812
GET      52.223       97.969
GET      54.783       98.125
GET      57.599       98.281
GET      60.671       98.438
GET      62.463       98.516
GET      64.255       98.594
GET      66.559       98.672
GET      68.607       98.750
GET      71.167       98.828
GET      73.727       98.906
GET      76.799       98.984
GET      79.359       99.062
GET      82.431       99.141
GET      86.015       99.219
GET      87.551       99.258
GET      89.599       99.297
GET      91.135       99.336
GET      93.183       99.375
GET      95.231       99.414
GET      97.279       99.453
GET      99.839       99.492
GET     102.399       99.531
GET     104.447       99.570
GET     107.519       99.609
GET     109.055       99.629
GET     110.591       99.648
GET     112.127       99.668
GET     114.175       99.688
GET     116.223       99.707
GET     118.271       99.727
GET     120.319       99.746
GET     122.879       99.766
GET     124.927       99.785
GET     127.999       99.805
GET     130.047       99.814
GET     132.095       99.824
GET     134.143       99.834
GET     136.191       99.844
GET     138.239       99.854
GET     140.287       99.863
GET     143.359       99.873
GET     147.455       99.883
GET     150.527       99.893
GET     154.623       99.902
GET     156.671       99.907
GET     157.695       99.912
GET     160.767       99.917
GET     162.815       99.922
GET     165.887       99.927
GET     167.935       99.932
GET     171.007       99.937
GET     174.079       99.941
GET     177.151       99.946
GET     181.247       99.951
GET     183.295       99.954
GET     185.343       99.956
GET     187.391       99.958
GET     190.463       99.961
GET     192.511       99.963
GET     196.607       99.966
GET     199.679       99.968
GET     203.775       99.971
GET     207.871       99.973
GET     212.991       99.976
GET     216.063       99.977
GET     218.111       99.978
GET     220.159       99.979
GET     222.207       99.980
GET     225.279       99.982
GET     227.327       99.983
GET     229.375       99.984
GET     232.447       99.985
GET     236.543       99.987
GET     239.615       99.988
GET     240.639       99.988
GET     242.687       99.989
GET     244.735       99.990
GET     246.783       99.990
GET     248.831       99.991
GET     253.951       99.991
GET     255.999       99.992
GET     258.047       99.993
GET     262.143       99.993
GET     270.335       99.994
GET     270.335       99.994
GET     272.383       99.995
GET     274.431       99.995
GET     276.479       99.995
GET     278.527       99.995
GET     280.575       99.996
GET     282.623       99.996
GET     284.671       99.996
GET     284.671       99.997
GET     288.767       99.997
GET     288.767       99.997
GET     292.863       99.997
GET     296.959       99.997
GET     299.007       99.998
GET     301.055       99.998
GET     305.151       99.998
GET     307.199       99.998
GET     309.247       99.998
GET     311.295       99.998
GET     317.439       99.998
GET     317.439       99.999
GET     319.487       99.999
GET     319.487       99.999
GET     321.535       99.999
GET     327.679       99.999
GET     329.727       99.999
GET     331.775       99.999
GET     333.823       99.999
GET     333.823       99.999
GET     337.919       99.999
GET     337.919       99.999
GET     342.015       99.999
GET     344.063       99.999
GET     344.063       99.999
GET     346.111       99.999
GET     372.735       99.999
GET     372.735      100.000
GET     374.783      100.000
GET     389.119      100.000
GET     391.167      100.000
GET     391.167      100.000
GET     391.167      100.000
GET     419.839      100.000
GET     440.319      100.000
GET     440.319      100.000
GET     442.367      100.000
GET     442.367      100.000
GET     442.367      100.000
[...]
GET     444.415      100.000
GET     444.415      100.000
GET     444.415      100.000
GET     491.519      100.000
GET     493.567      100.000
GET     493.567      100.000
GET     493.567      100.000
[...]
GET     495.615      100.000
GET     495.615      100.000
GET     495.615      100.000
[...]
GET     497.663      100.000
GET     497.663      100.000
---
WAIT      0.000      100.000